# statistics

In [2]:
import pandas as pd

In [4]:
df = pd.read_csv('data.csv')
df

   city  temp  humidity condition
0   hyd    23        45     rainy
1   hyd    24        46     rainy
2   hyd    25        47     rainy
3   hyd    26        48     sunny
4  bang    27        49     sunny
5  bang    28        50     sunny
6  bang    29        51    cloudy
7  bang    30        52    cloudy

In [6]:
df['temp'].max()

np.int64(30)

In [8]:
df['temp'].min()

np.int64(23)

In [10]:
df['temp'].mean()

np.float64(26.5)

In [12]:
df['temp'].mode()

0    23
1    24
2    25
3    26
4    27
5    28
6    29
7    30
Name: temp, dtype: int64

In [14]:
df['temp'].describe()

count     8.00000
mean     26.50000
std       2.44949
min      23.00000
25%      24.75000
50%      26.50000
75%      28.25000
max      30.00000
Name: temp, dtype: float64

In [16]:
df[df.temp == df.temp.max()]

   city  temp  humidity condition
7  bang    30        52    cloudy

In [18]:
df.city[df.temp == df.temp.max()]

7    bang
Name: city, dtype: object

In [20]:
df.count()

city         8
temp         8
humidity     8
condition    8
dtype: int64

In [22]:
df['city'].nunique()

2

In [24]:
df['city'].value_counts()

city
hyd     4
bang    4
Name: count, dtype: int64

# Group by

In [27]:
df = pd.read_csv('data.csv')
df

   city  temp  humidity condition
0   hyd    23        45     rainy
1   hyd    24        46     rainy
2   hyd    25        47     rainy
3   hyd    26        48     sunny
4  bang    27        49     sunny
5  bang    28        50     sunny
6  bang    29        51    cloudy
7  bang    30        52    cloudy

# String Cleaning

In [30]:
import pandas as pd
df = pd.read_csv('data.csv')
df

   city  temp  humidity condition
0   hyd    23        45     rainy
1   hyd    24        46     rainy
2   hyd    25        47     rainy
3   hyd    26        48     sunny
4  bang    27        49     sunny
5  bang    28        50     sunny
6  bang    29        51    cloudy
7  bang    30        52    cloudy

In [32]:
df['city'] = df['city'].str.upper()
df

   city  temp  humidity condition
0   HYD    23        45     rainy
1   HYD    24        46     rainy
2   HYD    25        47     rainy
3   HYD    26        48     sunny
4  BANG    27        49     sunny
5  BANG    28        50     sunny
6  BANG    29        51    cloudy
7  BANG    30        52    cloudy

In [34]:
df['condition'] = df['condition'].str.upper()
df

   city  temp  humidity condition
0   HYD    23        45     RAINY
1   HYD    24        46     RAINY
2   HYD    25        47     RAINY
3   HYD    26        48     SUNNY
4  BANG    27        49     SUNNY
5  BANG    28        50     SUNNY
6  BANG    29        51    CLOUDY
7  BANG    30        52    CLOUDY

In [36]:
df['city'] = df['city'].str.lower()
df

   city  temp  humidity condition
0   hyd    23        45     RAINY
1   hyd    24        46     RAINY
2   hyd    25        47     RAINY
3   hyd    26        48     SUNNY
4  bang    27        49     SUNNY
5  bang    28        50     SUNNY
6  bang    29        51    CLOUDY
7  bang    30        52    CLOUDY

In [38]:
df['city']=df['city'].str.replace('hyd','chennai')
df

      city  temp  humidity condition
0  chennai    23        45     RAINY
1  chennai    24        46     RAINY
2  chennai    25        47     RAINY
3  chennai    26        48     SUNNY
4     bang    27        49     SUNNY
5     bang    28        50     SUNNY
6     bang    29        51    CLOUDY
7     bang    30        52    CLOUDY

# concate Data Frame

In [41]:
india_weather = pd.DataFrame({
    "city" : ["mumbai","hyd","delhi"],
    "Temp":[32,33,35]
})
india_weather

     city  Temp
0  mumbai    32
1     hyd    33
2   delhi    35

In [43]:
us_weather = pd.DataFrame({
    "city" : ["nyc","chicago","orland"],
    "Temp":[32,23,25]
})
us_weather

      city  Temp
0      nyc    32
1  chicago    23
2   orland    25

In [45]:
df =pd.concat([india_weather,us_weather])
df

      city  Temp
0   mumbai    32
1      hyd    33
2    delhi    35
0      nyc    32
1  chicago    23
2   orland    25

In [47]:
df =pd.concat([india_weather,us_weather],ignore_index=True)  #ignore index is used to change index in order
df

      city  Temp
0   mumbai    32
1      hyd    33
2    delhi    35
3      nyc    32
4  chicago    23
5   orland    25

In [49]:
df =pd.concat([india_weather,us_weather],axis=1)
df

     city  Temp     city  Temp
0  mumbai    32      nyc    32
1     hyd    33  chicago    23
2   delhi    35   orland    25

# Merge Data Frames

In [52]:
temp = pd.DataFrame({
    "city" : ["mumbai","hyd","delhi","vizag"],
    "Temp":[32,33,35,40]
})
temp

     city  Temp
0  mumbai    32
1     hyd    33
2   delhi    35
3   vizag    40

In [54]:
humidity = pd.DataFrame({
    "city" : ["bengaluru","hyd","chennai","tirupati"],
    "humidity":[2,33,42,40]
})
humidity

        city  humidity
0  bengaluru         2
1        hyd        33
2    chennai        42
3   tirupati        40

In [56]:
df =pd.merge(temp,humidity,on="city")
df

  city  Temp  humidity
0  hyd    33        33

In [58]:
df =pd.merge(temp,humidity,on="city",how="outer")
df

        city  Temp  humidity
0  bengaluru   NaN       2.0
1    chennai   NaN      42.0
2      delhi  35.0       NaN
3        hyd  33.0      33.0
4     mumbai  32.0       NaN
5   tirupati   NaN      40.0
6      vizag  40.0       NaN

In [60]:
df.isnull()

    city   Temp  humidity
0  False   True     False
1  False   True     False
2  False  False      True
3  False  False     False
4  False  False      True
5  False   True     False
6  False  False      True

In [62]:
df.isnull().sum()

city        0
Temp        3
humidity    3
dtype: int64

In [64]:
df['Temp']=df['Temp'].fillna(df.Temp.min())
df.isnull()

    city   Temp  humidity
0  False  False     False
1  False  False     False
2  False  False      True
3  False  False     False
4  False  False      True
5  False  False     False
6  False  False      True

In [66]:
df

        city  Temp  humidity
0  bengaluru  32.0       2.0
1    chennai  32.0      42.0
2      delhi  35.0       NaN
3        hyd  33.0      33.0
4     mumbai  32.0       NaN
5   tirupati  32.0      40.0
6      vizag  40.0       NaN